/* 정보처리기사 실기 SQL 기출문제 */

/* 2025년도 - 1회
7. 다음은 SQL 문제이다. 아래 두 테이블을 참고하여 보기에 쿼리 실행 결과를 작성하시오.

[emp 테이블]              [sal 테이블]
+------+-------+         +------+------------+
|  id  |  name |         |  id  | incentives |
+------+-------+         +------+------------+
| 1001 | 김철수 |         | 1001 |     300    |
| 1002 | 홍길동 |         | 1002 |     300    |
| 1004 | 강감찬 |         | 1004 |    1000    |
| 1008 | 이순신 |         | 1008 |     500    |
+------+-------+         +------+------------+

SELECT name, incentive FROM emp, sal WHERE emp.id = sal.id and incentives >= 500

*/


/* 정답)
+---------+------------+
|   name  | incentives |        // 컬럼명까지 작성해야 함!!
+---------+------------+
|  이순신  |    500     |
+---------+------------+

~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~.~ */

